/**********************************************************
* @ File name -> iic.c
* @ Version   -> V1.1.1
* @ Date      -> 12-10-2013
* @ Brief     -> MCU模拟IIC通讯函数
* @           -> 要改变传输频率，请修改延时函数中的数值即可

 V1.1
* @ Revise    -> A、修正兼容夸平台移植
* @           -> B、修正接收数据时错位BUG

 V1.1.1
* @ Revise    -> 增加是否使用延时函数调整通讯频率宏定义 
**********************************************************/

#include "iic.h"

/**********************************************************
* 函数功能 ---> GPIO初始化
* 入口参数 ---> none
* 返回数值 ---> none
* 功能说明 ---> STM32平台，其他平台请修改或者注释掉
**********************************************************/
void IIC_GPIO_Init(void)
{	
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);	//开启GPIOB外设时钟，PB.6（SCL） and PB.7（SDA）
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;	//初始化GPIOB.6 and GPIOB.7
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//GPIO翻转速度为50MHz

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;	//设置为推挽输出

	GPIO_Init(GPIOB, &GPIO_InitStructure);	//初始化GPIO相关结构体

	GPIO_SetBits(GPIOB, GPIO_Pin_6 | GPIO_Pin_7);	//输出高电平，置IIC总线空闲	
}

//=========================================================

#ifdef	USER_DELAY_CLK	//定义了则使用延时调整通讯频率

//=========================================================

/**********************************************************
* 函数功能 ---> IIC启动
* 入口参数 ---> none
* 返回数值 ---> none
* 功能说明 ---> SCL高电平期间，SDA由高电平突变到低电平时启动总线
**********************************************************/
void IIC_Start(void)
{
	IIC_SDA_OUT();	//设置成输出
	
	IIC_SDA = 1;	//为SDA下降启动做准备
	IIC_SCL = 1;	//在SCL高电平时，SDA为下降沿时候总线启动
	IIC_Delay();
	IIC_SDA = 0;	//突变，总线启动
	IIC_Delay();
	IIC_SCL = 0;
	IIC_Delay();
}
/**********************************************************
* 函数功能 ---> IIC停止
* 入口参数 ---> none
* 返回数值 ---> none
* 功能说明 ---> SCL高电平期间，SDA由低电平突变到高电平时停止总线
**********************************************************/
void IIC_Stop(void)
{
	IIC_SDA_OUT();	//设置成输出

	IIC_SDA = 0;	//为SDA上升做准备
	IIC_Delay();
	IIC_SCL = 1;	//在SCL高电平时，SDA为上升沿时候总线停止
	IIC_Delay();
	IIC_SDA = 1;	//突变，总线停止
	IIC_Delay();
}
/**********************************************************
* 函数功能 ---> 主机向从机发送应答信号
* 入口参数 ---> a：应答信号
*                  0：应答信号
*                  1：非应答信号
* 返回数值 ---> none
* 功能说明 ---> none
**********************************************************/
void IIC_Ack(u8 a)
{
	IIC_SDA_OUT();	//设置成输出

	if(a)	IIC_SDA = 1;	//放上应答信号电平
	else	IIC_SDA = 0;

	IIC_Delay();
	IIC_SCL = 1;	//为SCL下降做准备
	IIC_Delay();
	IIC_SCL = 0;	//突变，将应答信号发送过去
	IIC_Delay();
}
/**********************************************************
* 函数功能 ---> 向IIC总线发送一个字节数据
* 入口参数 ---> dat：要发送的数据
* 返回数值 ---> ack：返回应答信号
* 功能说明 ---> none
**********************************************************/
u8 IIC_Write_Byte(u8 dat)
{
	u8 i;
	u8 iic_ack=0;	//iic应答标志

	IIC_SDA_OUT();	//设置成输出

	for(i = 0;i < 8;i++)
	{
		if(dat & 0x80)	IIC_SDA = 1;	//判断发送位，先发送高位
		else	IIC_SDA = 0;
			
		IIC_Delay();
		IIC_SCL = 1;	//为SCL下降做准备
		IIC_Delay();
		IIC_SCL = 0;	//突变，将数据位发送过去
		dat<<=1;	//数据左移一位
	}	//字节发送完成，开始接收应答信号

	IIC_SDA = 1;	//释放数据线

	IIC_SDA_IN();	//设置成输入

	IIC_Delay();
	IIC_SCL = 1;	//为SCL下降做准备
	IIC_Delay();
	iic_ack |= IN_SDA;	//读入应答位
	IIC_SCL = 0;
	return iic_ack;	//返回应答信号
}
/**********************************************************
* 函数功能 ---> 从IIC总线上读取一个字节数据
* 入口参数 ---> none
* 返回数值 ---> x：读取到的数据
* 功能说明 ---> none
**********************************************************/	
u8 IIC_Read_Byte(void)
{
	u8 i;
	u8 x=0;

	IIC_SDA = 1;	//首先置数据线为高电平

	IIC_SDA_IN();	//设置成输入

	for(i = 0;i < 8;i++)
	{
		x <<= 1;	//读入数据，高位在前

		IIC_Delay();
		IIC_SCL = 1;	//突变
		IIC_Delay();
		
		if(IN_SDA)	x |= 0x01;	//收到高电平

		IIC_SCL = 0;
		IIC_Delay();
	}	//数据接收完成
	IIC_SCL = 0;

	return x;	//返回读取到的数据
}

//=========================================================

#else	//否则不使用延时调整通讯频率

//=========================================================

/**********************************************************
* 函数功能 ---> IIC启动
* 入口参数 ---> none
* 返回数值 ---> none
* 功能说明 ---> SCL高电平期间，SDA由高电平突变到低电平时启动总线
**********************************************************/
void IIC_Start(void)
{
	IIC_SDA_OUT();	//设置成输出
	
	IIC_SDA = 1;	//为SDA下降启动做准备
	IIC_SCL = 1;	//在SCL高电平时，SDA为下降沿时候总线启动
	IIC_SDA = 0;	//突变，总线启动
	IIC_SCL = 0;
}
/**********************************************************
* 函数功能 ---> IIC停止
* 入口参数 ---> none
* 返回数值 ---> none
* 功能说明 ---> SCL高电平期间，SDA由低电平突变到高电平时停止总线
**********************************************************/
void IIC_Stop(void)
{
	IIC_SDA_OUT();	//设置成输出

	IIC_SDA = 0;	//为SDA上升做准备
	IIC_SCL = 1;	//在SCL高电平时，SDA为上升沿时候总线停止
	IIC_SDA = 1;	//突变，总线停止
}
/**********************************************************
* 函数功能 ---> 主机向从机发送应答信号
* 入口参数 ---> a：应答信号
*                  0：应答信号
*                  1：非应答信号
* 返回数值 ---> none
* 功能说明 ---> none
**********************************************************/
void IIC_Ack(u8 a)
{
	IIC_SDA_OUT();	//设置成输出

	if(a)	IIC_SDA = 1;	//放上应答信号电平
	else	IIC_SDA = 0;

	IIC_SCL = 1;	//为SCL下降做准备
	IIC_SCL = 0;	//突变，将应答信号发送过去
}
/**********************************************************
* 函数功能 ---> 向IIC总线发送一个字节数据
* 入口参数 ---> dat：要发送的数据
* 返回数值 ---> ack：返回应答信号
* 功能说明 ---> none
**********************************************************/
u8 IIC_Write_Byte(u8 dat)
{
	u8 i;
	u8 iic_ack=0;	//iic应答标志

	IIC_SDA_OUT();	//设置成输出

	for(i = 0;i < 8;i++)
	{
		if(dat & 0x80)	IIC_SDA = 1;	//判断发送位，先发送高位
		else	IIC_SDA = 0;
			
		IIC_SCL = 1;	//为SCL下降做准备
		IIC_SCL = 0;	//突变，将数据位发送过去
		dat <<= 1;	//数据左移一位
	}	//字节发送完成，开始接收应答信号

	IIC_SDA = 1;	//释放数据线

	IIC_SDA_IN();	//设置成输入

	IIC_SCL = 1;	//为SCL下降做准备
	iic_ack |= IN_SDA;	//读入应答位
	IIC_SCL = 0;
	return iic_ack;	//返回应答信号
}
/**********************************************************
* 函数功能 ---> 从IIC总线上读取一个字节数据
* 入口参数 ---> none
* 返回数值 ---> x：读取到的数据
* 功能说明 ---> none
**********************************************************/	
u8 IIC_Read_Byte(void)
{
	u8 i;
	u8 x=0;

	IIC_SDA = 1;	//首先置数据线为高电平

	IIC_SDA_IN();	//设置成输入

	for(i = 0;i < 8;i++)
	{
		x <<= 1;	//读入数据，高位在前

		IIC_SCL = 1;	//突变
		
		if(IN_SDA)	x |= 0x01;	//收到高电平

		IIC_SCL = 0;
	}	//数据接收完成
	IIC_SCL = 0;

	return x;	//返回读取到的数据
}

//=========================================================

#endif

//=========================================================

