/**********************************************************
* @ File name -> spi.h
* @ Version   -> V1.1
* @ Date      -> 11-05-2013
* @ Brief     -> STM32硬件SPI驱动函数头文件

 V1.
* @ Revise    -> 
**********************************************************/

#ifndef _spi_h_
#define _spi_h_

/**********************************************************
                     外部函数头文件
         应用到不同的外设头文件请在这里修改即可                        
**********************************************************/

#include "STM32_config.h"

/**********************************************************
                        外部功能函数
**********************************************************/

void SPI_GPIO_Init(void);	//GPIO初始化

void SPIx_SetSpeed(u8 SPI_Speed);	//设置SPIx传送速度

u8 SPIx_WriteRead_Data(u8 write_dat);	//SPIx数据读写


#endif

