/**********************************************************
* @ File name -> rtc.h
* @ Version   -> V1.0
* @ Date      -> 03-02-2014
* @ Brief     -> STM32内部RTC驱动函数头文件

 V1.
* @ Revise    -> 
**********************************************************/

#ifndef _rtc_h_
#define _rtc_h_

/**********************************************************
                     外部函数头文件                        
**********************************************************/

#include "STM32_config.h"
#include "stm32f10x_rtc.h"
#include "bkp.h"

/**********************************************************
                   RTC时钟源选择宏定义
             使用不同的时钟源请修改这里即可
**********************************************************/

#define RTC_CRYSTAL_SELECT					1	//RTC时钟源选择
                                                //1：外部32.768KHz晶振源LSE
												//2：内部40KHz晶振源LSI
												//3：HSE/128分频得到

/**********************************************************
                  PCF8563寄存器结构定义                          
**********************************************************/

typedef struct
{
	uint16_t year;	//年
	uint8_t month;	//月
	uint8_t date;	//日
	uint8_t week;	//星期
	uint8_t hour;	//小时
	uint8_t minute;	//分钟
	uint8_t second;	//秒钟
}STMRTC_Typedef;

extern STMRTC_Typedef RTC_TimeValue;	//定义时间数据缓存

extern uint8_t RTC_Display_Time[8];	//时间显示
extern uint8_t RTC_Display_Date[13];	//日期显示

/**********************************************************
                        定义相关变量
**********************************************************/

#define RTC_Init_FlagData					(uint16_t)0xa5a5	//写入备份寄存器作为RTC是否初始化默认时间标志

/**********************************************************
                     外部功能函数
**********************************************************/

uint8_t RTC_Init(void);	//初始化RTC_Time
uint32_t RTC_SetTime(void);	//设置RTC时间
void RTC_GetTime(void);	//读取RTC时间日历信息
void RTC_Time_Handle(void);	//时间日历数据处理函数


#endif

