/**********************************************************
* @ File name -> bkp.c
* @ Version   -> V1.0
* @ Date      -> 01-24-2014
* @ Brief     -> 片内备份寄存器驱动函数

 V1.
* @ Revise    -> 
**********************************************************/

#include "bkp.h"

/**********************************************************
* 函数功能 ---> 初始化备份寄存器
* 入口参数 ---> none
* 返回数值 ---> none
* 功能说明 ---> none
**********************************************************/
void BKP_Init(void)
{
	RCC->APB1ENR |= (1 << 28);	//电源接口使能
	RCC->APB1ENR |= (1 << 27);	//备份接口时钟开启
}
/**********************************************************
* 函数功能 ---> 备份寄存器写入数据
* 入口参数 ---> addr：写入数据区地址
*               bkp_data：要写入的数据
* 返回数值 ---> none
* 功能说明 ---> addr地址范围：BKP_DR1 ~ BKP_DR42
**********************************************************/
void BKP_Write_Byte(uint32_t addr,uint16_t bkp_data)
{
	__IO uint32_t tmp = 0;
	
	assert_param(IS_BKP_DR(addr));
	
	PWR->CR |= (1 << 8);	//允许写入RTC和后备寄存器
	
	tmp = (uint32_t)BKP_BASE;	//得到BKP在总线上的偏移地址
	tmp += addr;	//得到寄存器地址偏移量
	
	*(__IO uint32_t *)tmp = bkp_data;	//写入数据
	
	PWR->CR |= (0 << 8);	//禁止写入RTC和后备寄存器，防止意外操作备份寄存器区域
}
/**********************************************************
* 函数功能 ---> 备份寄存器读取数据
* 入口参数 ---> addr：写入数据区地址
* 返回数值 ---> 读取到的16位数据
* 功能说明 ---> addr地址范围：BKP_DR1 ~ BKP_DR42
**********************************************************/	
uint16_t BKP_Read_Byte(uint32_t addr)
{
	__IO uint32_t tmp = 0;
	
	assert_param(IS_BKP_DR(addr));
		
	tmp = (uint32_t)BKP_BASE;	//得到BKP在总线上的偏移地址
	tmp += addr;	//得到寄存器地址偏移量
	
	return (*(__IO uint32_t *)tmp);	//返回数据
}

