/**********************************************************
* @ File name -> bkp.h
* @ Version   -> V1.0
* @ Date      -> 01-24-2014
* @ Brief     -> 片内备份寄存器驱动函数头文件

 V1.
* @ Revise    -> 
**********************************************************/

#ifndef _bkp_h_
#define _bkp_h_

/**********************************************************
                     外部函数头文件                        
**********************************************************/

#include "STM32_config.h"

#include "stm32f10x_bkp.h"

/**********************************************************
                     外部功能函数
**********************************************************/

void BKP_Init(void);	//初始化备份寄存器
void BKP_Write_Byte(uint32_t addr,uint16_t bkp_data);	//备份寄存器写入数据
uint16_t BKP_Read_Byte(uint32_t addr);	//备份寄存器读取数据


#endif

