/**********************************************************
* @ File name -> Adjust_time.h
* @ Version   -> V1.0
* @ Date      -> 01-19-2014
* @ Brief     -> 调整时间函数头文件

 V1.
* @ Revise    -> 
**********************************************************/

#ifndef _Adjust_time_h_
#define _Adjust_time_h_

/**********************************************************
                     外部函数头文件
         应用到不同的外设头文件请在这里修改即可                        
**********************************************************/

#include "STM32_config.h"

#include "key.h"
#include "lcd_tft.h"
#include "pcf8563.h"

/**********************************************************
                       外部功能函数                      
**********************************************************/

extern u8 dis_mode;	//显示切换状态变量


void Refresh_Display_Time(void);	//时间日历显示刷新函数

void Key_Handle(void);	//按键处理函数


#endif

